<font color='red'><h1> Pandas workbook </h1></font>

## Table of contents
1. Introduction
2. Series
3. Creating dataframe
4. View data
5. Indexing and slicing
6. Manipulate dataframe
7. Group by
8. Apply

## 1. Introduction

Pandas is a python library used to deal with data in tabular format. Using pandas you can handle large data, analyse it, derive conclusions from it and much more. It has in-built functions to deal with large data. 

Pandas is very important to learn. In online assesment and interview questions from it are asked. Practicing pandas exercises is must for data scientist.

Pandas is used with numpy. See the code below.

In [1]:
import pandas as pd
import numpy as np

## 2. Series

Pandas series is a 1D labeled array which can hold heteregenous values.

In [4]:
s1 = pd.Series([1,2,3, 'Karan'])
s2 = pd.Series({1 : 'Karan', 2 : 'Hadiyal'})

In [15]:
print(s1[0], s2[1])

1 Karan

## 3. Creating dataframe

Dataframe is like 2D array, It can have multiple data types. It is most widely used to store data. There are many ways to create a dataframe. See the code below.

In [18]:
# Creating dataframe from python list
data = [["Karan",20],["Prince",24],["Amit",30]]
df = pd.DataFrame(data,columns=["Name","Age"])
df

     Name  Age
0   Karan   20
1  Prince   24
2    Amit   30

In [19]:
names = ["Karan","Prince","Amit"]
ages = [20,24,30]
df = pd.DataFrame(list(zip(names,ages)), columns=["Name","Age"])
df

     Name  Age
0   Karan   20
1  Prince   24
2    Amit   30

In [20]:
# From dictionary
data = {'Name' : ["Karan","Amit","Prince"],
       'Age' : [20,30,24]}

df = pd.DataFrame(data)
df

     Name  Age
0   Karan   20
1    Amit   30
2  Prince   24

In [21]:
# Reading CSV file
df = pd.read_csv(path)

In [ ]:
# Reading excel file
df = pd.read_excel(path)

## 4. View data

In [2]:
df = pd.read_csv('car_data.csv')

In [25]:
df.head() # Show top 5 rows, df.head(n) shows top n rows

,ID,Price,Levy,Manufacturer,Model,Prod. year,Category,Leather interior,Fuel type,Engine volume,Mileage,Cylinders,Gear box type,Drive wheels,Doors,Wheel,Color,Airbags
0,45654403,13328,1399,LEXUS,RX 450,2010,Jeep,Yes,Hybrid,3.5,186005 km,6.0,Automatic,4x4,04-May,Left wheel,Silver,12
1,44731507,16621,1018,CHEVROLET,Equinox,2011,Jeep,No,Petrol,3,192000 km,6.0,Tiptronic,4x4,04-May,Left wheel,Black,8
2,45774419,8467,-,HONDA,FIT,2006,Hatchback,No,Petrol,1.3,200000 km,4.0,Variator,Front,04-May,Right-hand drive,Black,2
3,45769185,3607,862,FORD,Escape,2011,Jeep,Yes,Hybrid,2.5,168966 km,4.0,Automatic,4x4,04-May,Left wheel,White,0
4,45809263,11726,446,HONDA,FIT,2014,Hatchback,Yes,Petrol,1.3,91901 km,4.0,Automatic,Front,04-May,Left wheel,Silver,4

Similarly, df.tail() shows last rows

In [30]:
df.info() # Gives information about pandas columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19237 entries, 0 to 19236
Data columns (total 18 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ID                19237 non-null  int64
 1   Price             19237 non-null  int64
 2   Levy              19237 non-null  object
 3   Manufacturer      19237 non-null  object
 4   Model             19237 non-null  object
 5   Prod. year        19237 non-null  int64
 6   Category          19237 non-null  object
 7   Leather interior  19237 non-null  object
 8   Fuel type         19237 non-null  object
 9   Engine volume     19237 non-null  object
 10  Mileage           19237 non-null  object
 11  Cylinders         19237 non-null  float64
 12  Gear box type     19237 non-null  object
 13  Drive wheels      19237 non-null  object
 14  Doors             19237 non-null  object
 15  Wheel             19237 non-null  object
 16  Color             19237 non-null  object
 17  Airbags           19237 non-null  int64
dtypes: float64(1), int64(4), object(13)
memory usage: 2.6+ MB

In [31]:
df.describe() # Describes numerical columns as shown below

                 ID         Price    Prod. year     Cylinders       Airbags
count  1.923700e+04  1.923700e+04  19237.000000  19237.000000  19237.000000
mean   4.557654e+07  1.855593e+04   2010.912824      4.582991      6.582627
std    9.365914e+05  1.905813e+05      5.668673      1.199933      4.320168
min    2.074688e+07  1.000000e+00   1939.000000      1.000000      0.000000
25%    4.569837e+07  5.331000e+03   2009.000000      4.000000      4.000000
50%    4.577231e+07  1.317200e+04   2012.000000      4.000000      6.000000
75%    4.580204e+07  2.207500e+04   2015.000000      4.000000     12.000000
max    4.581665e+07  2.630750e+07   2020.000000     16.000000     16.000000

In [32]:
df.columns # Gives column names

Index(['ID', 'Price', 'Levy', 'Manufacturer', 'Model', 'Prod. year',
       'Category', 'Leather interior', 'Fuel type', 'Engine volume', 'Mileage',
       'Cylinders', 'Gear box type', 'Drive wheels', 'Doors', 'Wheel', 'Color',
       'Airbags'],
      dtype='object')

In [17]:
df.shape # Shape of dataframe

(19237, 18)

In [18]:
df.isna().sum() # Gives null value count for each column

ID                  0
Price               0
Levy                0
Manufacturer        0
Model               0
Prod. year          0
Category            0
Leather interior    0
Fuel type           0
Engine volume       0
Mileage             0
Cylinders           0
Gear box type       0
Drive wheels        0
Doors               0
Wheel               0
Color               0
Airbags             0
dtype: int64

In [19]:
df["Category"].value_counts() # Count value for each category

Category
Sedan          8736
Jeep           5473
Hatchback      2847
Minivan         647
Coupe           532
Universal       364
Microbus        306
Goods wagon     233
Pickup           52
Cabriolet        36
Limousine        11
Name: count, dtype: int64

In [ ]:
df.corr() # Correlation matrix, works with numerical columns only

## 5. Indexing and slicing

In [3]:
df[3:5] # Shows rows from 3 to 5 (exclusive)

,ID,Price,Levy,Manufacturer,Model,Prod. year,Category,Leather interior,Fuel type,Engine volume,Mileage,Cylinders,Gear box type,Drive wheels,Doors,Wheel,Color,Airbags
3,45769185,3607,862,FORD,Escape,2011,Jeep,Yes,Hybrid,2.5,168966 km,4.0,Automatic,4x4,04-May,Left wheel,White,0
4,45809263,11726,446,HONDA,FIT,2014,Hatchback,Yes,Petrol,1.3,91901 km,4.0,Automatic,Front,04-May,Left wheel,Silver,4

In [4]:
df.iloc[0:3] # iloc is used for numerical index

,ID,Price,Levy,Manufacturer,Model,Prod. year,Category,Leather interior,Fuel type,Engine volume,Mileage,Cylinders,Gear box type,Drive wheels,Doors,Wheel,Color,Airbags
0,45654403,13328,1399,LEXUS,RX 450,2010,Jeep,Yes,Hybrid,3.5,186005 km,6.0,Automatic,4x4,04-May,Left wheel,Silver,12
1,44731507,16621,1018,CHEVROLET,Equinox,2011,Jeep,No,Petrol,3,192000 km,6.0,Tiptronic,4x4,04-May,Left wheel,Black,8
2,45774419,8467,-,HONDA,FIT,2006,Hatchback,No,Petrol,1.3,200000 km,4.0,Variator,Front,04-May,Right-hand drive,Black,2

In [5]:
df.loc[0:3] # loc is used for non-numerical index also, observe last index here

,ID,Price,Levy,Manufacturer,Model,Prod. year,Category,Leather interior,Fuel type,Engine volume,Mileage,Cylinders,Gear box type,Drive wheels,Doors,Wheel,Color,Airbags
0,45654403,13328,1399,LEXUS,RX 450,2010,Jeep,Yes,Hybrid,3.5,186005 km,6.0,Automatic,4x4,04-May,Left wheel,Silver,12
1,44731507,16621,1018,CHEVROLET,Equinox,2011,Jeep,No,Petrol,3,192000 km,6.0,Tiptronic,4x4,04-May,Left wheel,Black,8
2,45774419,8467,-,HONDA,FIT,2006,Hatchback,No,Petrol,1.3,200000 km,4.0,Variator,Front,04-May,Right-hand drive,Black,2
3,45769185,3607,862,FORD,Escape,2011,Jeep,Yes,Hybrid,2.5,168966 km,4.0,Automatic,4x4,04-May,Left wheel,White,0

In [6]:
df[['ID', 'Price']] # Shows this columns

             ID  Price
0      45654403  13328
1      44731507  16621
2      45774419   8467
3      45769185   3607
4      45809263  11726
...         ...    ...
19232  45798355   8467
19233  45778856  15681
19234  45804997  26108
19235  45793526   5331
19236  45813273    470

[19237 rows x 2 columns]

In [8]:
df[df['Price'] > 10000][['ID']] # Shows ID of all rows satisfying the condition

             ID
0      45654403
1      44731507
4      45809263
5      45802912
9      45756839
...         ...
19222  45732720
19224  45768089
19227  45769427
19233  45778856
19234  45804997

[11642 rows x 1 columns]

In [11]:
df[(df['Price'] > 1000) & (df['Manufacturer'] == 'LEXUS')][['ID']]

             ID
0      45654403
9      45756839
13     45661288
103    45756975
137    45764126
...         ...
19135  45787015
19145  45798424
19161  45677230
19191  45651422
19217  45804344

[641 rows x 1 columns]

## 6. Manipulate dataframe

In [ ]:
df.rename(columns={'ID':'id'}) # Renames column

In [ ]:
df = pd.read_csv(path, header=None) # Read dataframe without column names
df.columns = ['col 1', 'col 2', ..] # To add columns to dataframe

In [ ]:
df['new col'] = 0 # Adds new column with all 0
df['new col'] = prev_df['existing col'] # Copies the column from another dataframe

In [ ]:
df.loc[1] = [val1, val2, val3, ...] # Adds new row at index 1, Order of values

In [ ]:
# Append new row, order doesn't matter, dataframe also can be appended
df.append({'col 1': val1,'col 2':val2}, ignore_index=True)

In [ ]:
# Concatenate dataframes
df = pd.concat([df1, df2, df3], ignore_index = True)

In [ ]:
df = df.reset_index(drop=True) # Resets the index (0 to rows - 1)

In [ ]:
# Drops the column
df.drop('Col 1', axis = 1, inplace=True)

In [ ]:
# Drops multiple columns
df.drop(columns=['Col 1', 'Col 2'], inplace = True)

In [ ]:
df.drop(index, inplace=True) # Drops the row of index

## 7. Group by

Group by function is used to group elements based on some category. It returns pandas object, the aggregation function are used with groupby. See the below code.

In [39]:
# Reads selected columns, helpful in large CSV
df = pd.read_csv('car_data.csv', usecols=['Price', 'Manufacturer', 'Prod. year', 'Category'])

In [13]:
# Returns object of pandas
obj = df.groupby(['Category'])

In [17]:
# Mean of price for each category, return pandas series
obj['Price'].mean()

Category
Cabriolet       24583.694444
Coupe           21250.406015
Goods wagon    122916.180258
Hatchback       11381.245873
Jeep            23684.285949
Limousine       11534.454545
Microbus        18550.928105
Minivan         20531.221020
Pickup          28805.269231
Sedan           14231.545902
Universal       25253.700549
Name: Price, dtype: float64

You can functions like min, max, mean, median, std, var, count_values, etc

In [20]:
# Understand this line
obj['Manufacturer'].value_counts()['Sedan'][:10]

Manufacturer
HYUNDAI          2125
TOYOTA           1743
MERCEDES-BENZ    1225
CHEVROLET         572
BMW               480
FORD              466
VOLKSWAGEN        428
KIA               324
HONDA             235
NISSAN            166
Name: count, dtype: int64

In [21]:
# You can group using multiple columns
obj = df.groupby(['Category', 'Manufacturer'])

## 8. Apply

'apply' is used to apply function on all values of a column. A function is defined for a single value of column but by using 'apply' we can apply it on all values of column. See the code below.

In [25]:
# Basic function
def getGeneration(prod_year):
    if prod_year <= 2012:
        return 'Old Generation'
    
    return 'New Generation'

In [26]:
df['Generation'] = df['Prod. year'].apply(getGeneration)

In [30]:
df.head(3)

   Price Manufacturer  Prod. year   Category      Generation
0  13328        LEXUS        2010       Jeep  Old Generation
1  16621    CHEVROLET        2011       Jeep  Old Generation
2   8467        HONDA        2006  Hatchback  Old Generation

In [40]:
# Function taking multiple arguments
def getGeneration(prod_year, price):
    if prod_year <= 2012 or price >= 10000:
        return 'Old Generation'
    
    return 'New Generation'

In [41]:
# Apply function by using multiple columns
df['Generation'] = df.apply(lambda x : getGeneration(x['Prod. year'], x['Price']), axis=1)

In [42]:
df

       Price   Manufacturer  Prod. year   Category      Generation
0      13328          LEXUS        2010       Jeep  Old Generation
1      16621      CHEVROLET        2011       Jeep  Old Generation
2       8467          HONDA        2006  Hatchback  Old Generation
3       3607           FORD        2011       Jeep  Old Generation
4      11726          HONDA        2014  Hatchback  Old Generation
...      ...            ...         ...        ...             ...
19232   8467  MERCEDES-BENZ        1999      Coupe  Old Generation
19233  15681        HYUNDAI        2011      Sedan  Old Generation
19234  26108        HYUNDAI        2010       Jeep  Old Generation
19235   5331      CHEVROLET        2007       Jeep  Old Generation
19236    470        HYUNDAI        2012      Sedan  Old Generation

[19237 rows x 5 columns]